app/controllers/posts_controller.rb

  def show
    #or can be empty and just use h1 tag in show file
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]